var popups = [

    // 1
    {
        "title": "Порятунок улюблених джинсів — місія можлива.",
        "text": [
            "На фото ми показуємо приклади робіт з ремонту та реставрації. Підбираємо найбільш  схожі нитки, щоб відновити початкову обробку та оригінальний стібок.",
            "Ваші джинси після ремонту в ательє \"Білошвейка\" будуть як новенькі. Такий ремонт ми робимо дуже часто і тому маємо відповідний досвід та величезний вибір ниток джинсового кольору.",
            "Найпопулярніші операції по ремонту джинсів:",
            "- підкоротити",
            "- проштопати",
            "- вшити",
            "- замінити фурнітуру.",
            "1. Підкоротити джинси.",
            "Що може бути простіше? Але ми пропонуємо вам на вибір аж три варіанти:",
            "- Підкоротити джинси закритим зрізом. Підрізаємо, підгинаємо два рази та прострочуємо. Відновлюємо відстрочку такого ж кольору, як вона була в оригінальному вигляді.",
            "- Підкоротити джинси зі збереженням потертого низу. При такому виді ремонту необроблений фабричний низ ми акуратно знімаємо. Підшиваємо джинси на довжину, яку потрібно, а потім фабричний край приточуємо назад. Відновлюємо всі шви ниткою такого ж кольору, який був спочатку.",
            "- Підкоротити джинси зі зміщенням швів. Коли підкорочуємо джинси, підгинаємо два рази, потім робимо хвилю з самого матеріалу. Після прання кілька раз хвиля набуває потертого вигляду, як до ремонту.",
            "2. Заштопати джинси.",
            "Пошкоджене місце ми проштопуємо нитками, які підбираємо, щоб були максимально схожі з оригіналом. Ми також зміцнюємо це місце з внутрішньої сторони додатковим матеріалом, що допомагає з'єднати волокна. З лицевої сторони проштопуємо багато раз на машинці, щоб зробити схожим на плетіння джинсів.",
            "3. Вшити джинси.",
            "Є два варіанти такого ремонту. По середньому та по боковиму шву. Розбираємо, зрізаємо зайве і відновлюємо шви. Є можливість збереження фабричного потертого шва, так як і при підкороченні джинсів.",
            "4. Замінити фурнітуру.",
            "Крім того, є ще такі послуги по ремонту джинсів:",
            "- замінити підкладки в кишенях;",
            "- зробити потертість;",
            "- перешити джинси для вагітних.",
            "Ательє 'Білошвейка' завжди дає джинсам другий шанс. Результат здивує та порадує вас."
        ]
    },

    // 2
    {
        "title": "Ремонт штанів: від класичних до штанів для верхової їзди.",
        "text": [
            "Ми готові до будь-яких несподіванок. В ательє \"Білошвейка\" завжди готові допомогти.",
            "Найпопулярніші послуги з ремонту штанів:",
            "- підкоротити штани",
            "- реставрувати кишені",
            "- вшити штани",
            "- настрочити сідло",
            "- проштопати штани",
            "- наростити рідну тканину.",
            "1. Підкоротити штани.",
            "Такий ремонт можна зробити зі стрічкою та без стрічки. Можна відновити манжети, перенести їх або зробити нові. Будь-які способи обробки низу штанів відновлюємо до того вигляду, що був до ремонту.",
            "2. Реставрувати кишені.",
            "Ремонт передбачає заміну підкладки в кишенях, заміну блискавки, зміцнення та відновлення швів.",
            "3. Вшити штани.",
            "Штани вшиваємо по боковому та по середньому шву.",
            "4. Настрочити сідло.",
            "У випадку пошкодження внутрішньої сторони ми вшиваємо шматочки тканини з виробу або підбираємо ідентичну. Зазвичай це трикутник з прямими кутами.",
            "5. Проштопати штани.",
            "Ми не завжди рекомендуємо робити штопку штанів. Тому що штопка на гладеньких тканинах виглядає дуже негарно. Плетення тканини зовсім інше ніж у джинсах. Але на вимогу клієнта ми можемо зробити машинну чи ручну штопку. Ручна штопка має гарний вигляд на об'ємних, теплих тканинах. Ми знаходимо де витягнути з виробу рідну нитку і руками відновлюємо фрагмент пошкодженої тканини. Результати такого ремонту майже непомітні.",
            "6. Наростити рідну тканину.",
            "Якщо це брендовий костюм ми пропонуємо дорогу, але дуже ефективну послугу — нарощування рідної тканини. Ми знаходимо шматочок рідної тканини виробу. Потім цей шматочок розбираємо на тоненькі ниточки. Кожну цю ниточку вплітаємо в рідне плетіння на штанах. Процес ремонту довгий та складний, робиться під збільшувальним склом. Деколи такий ремонт займає весь день. Результати вражають, ремонт зовсім непомітний.",
            "Ми не просто відремонтуємо ваші штани. За допомогою рекомендацій висококласних спеціалістів, вони ще будуть кращі ніж до ремонту."
        ]   
    },

    // 3
    {
        "title": "Ремонт суконь — після золотих рук наших майстрів ви полюбите свою сукню ще більше ніж до ремонту.",
        "text": [
            "Ремонт може бути незначним — коли потрібно пришити ґудзик на офісному сарафані. А може й бути, на перший погляд, нереальним — коли потрібно вкоротити весільне плаття, в якому дев'ять нижніх спідниць, шлейф і мереживо.",
            "Найчастіше ми ремонтуємо такі сукні:",
            "- офісні з класичних матеріалів;",
            "- літні з бавовни та льону;",
            "- трикотажні облягаючі;",
            "- тематичні з різним напиленням, паєтками, стразами.",
            "Найпопулярніші послуги з ремонту суконь:",
            "- вкоротити довжину сукні або рукава;",
            "- змінити блискавку;",
            "- вшити сукню;",
            "- зміна дизайну;",
            "- укріпити розріз;",
            "- відновити шви на сукні з рельєфних тканин.",
            "1. Вкоротити довжину сукні або рукава.",
            "Наші майстри знають всі тонкощі такої роботи з різними видами тканин. Якщо потрібно вкоротити легку літню сукню, обов'язково має бути додаткова примірка. Не все так просто, як здається, коли потрібно вкоротити довжину сукні з тканини на підкладці. Варіант відрізав, підшив і все не проходить. Підкладку потрібно правильно виложити, вистрочити. Підкладка не повинна заважати. Наші майстри роблять багато таких ремонтів. Тому знають як зробити так, щоб сукня після ремонту продовжувала приносити задоволення.",
            "2. Змінити блискавку.",
            "Дуже часто блискавки на сукнях неякісні. Ми можемо підібрати та поставити схожу блискавку. Але, як правило, ми рекомендуємо ставити блискавки японського бренду YKK, адже вони носяться в разів 5 довше ніж звичайні китайські.",
            "3. Вшити сукню.",
            "Можемо вшити по талії, по виточках. А можемо просто розібрати по швах, викласти по фігурі та сукня буде виглядати на вас ідеально.",
            "4. Зміна дизайну.",
            "Можемо змінити форму горловини, змінити форму рукава, зробити додаткові шви, виточки. Від вас — ваш виріб та фантазія, від нас — оригінальне рішення для оновлення вашого гардеробу.",
            "5. Укріпити розріз.",
            "В облягаючих сукнях дуже часто рветься розріз. Основна причина — немає додаткових укріплень і матеріалів, що утримує це місце від розривів. На жаль в багатьох випадках виробники не думають взагалі про те, щоб людина могла довго носити придбану річ. Зате думаємо про це ми. Тому такі пошкодження ми не просто ремонтуємо, а ще й вдосконалюємо. Ми відновлюємо та зміцнюємо розріз, ставимо додаткові підкладки, стрічки, що допомагають попереджувати розрив в майбутньому.",
            "6. Відновити шви на сукні з рельєфних тканин.",
            "Дуже часто на таких сукнях невеликі припуски на швах і з часом шви розходяться. Ми ці припуски насаджуємо на прозорий проклеєний матеріал, виймаємо частину рідних ниток, відновлюємо та нарощуємо плетення. Така реставрація не просто відновлює шви, а й зміцнює їх.",
            "Особливі види ремонту:",
            "- шкіряні сукні — ремонтуємо рідкою шкірою, приклеюємо низ, що відклеївся, відновлюємо місця розрізів;",
            "- сукні для особливих випадків: весільні, вечірні — вшиваємо корсети, реставруємо розриви, вкорочуємо довжину.",
            "Майстри у нас мають значний досвід роботи та готові до будь-яких несподіванок. Всі види ремонту суконь важко описати, проблеми у замовників дуже різні. Але ми завжди готові  зробити все і навіть більше."
        ]
    },

    // 4
    {
        "title": "Ремонт сорочок — від простого пришивання гудзиків на класичній сорочці до складної реставрації мережива на шовковій блузі.",
        "text": [
            "Після ремонту в ательє \"Білошвейка\" ваша сорочка буде мати ідеальний вигляд.",
            "Основні види сорочок, що нам приносять на ремонт:",
            "- класичні бавовняні;",
            "- бавовняні з поліестером;",
            "- шовкові;",
            "- шовкові з віскозою;",
            "- трикотажні;",
            "- святкові блузи з декором, пір'ям, мереживом, стрічками.",
            "Найчастіше ми робимо такий ремонт сорочок:",
            "- вкорочуємо низ сорочки, повторюємо попередню обробку та форму(прямий, фігурний, з розрізами);",
            "- вкорочуємо низ рукава, навіть якщо ваша блуза має нереальний дизайн рукавів та багато видів обробки (хоча такий ремонт це досить затратно по часу та по ціні);",
            "- вшиваємо по боковим швам;",
            "- змінюємо горловину та форму коміра;",
            "- реставруємо потертості;",
            "- пришиваємо гудзики;",
            "- змінюємо розмір пройми;",
            "- настрочуємо декоративні латки на лікті;",
            "- в трикотажних сорочках перетягуємо затяжки;",
            "- вшиваємо рукава.",
            "Результат ремонту вашої улюбленої сорочки перевершить очікування. Відремонтуємо так, що ніхто й не побачить, що сорочка після ремонту."
        ]
    },

    //5
    {
        "title": "Ремонт футболок — відновимо вашу футболку до ідеального вигляду.",
        "text": [
            "В ательє \"Білошвейка\" для такого ремонту  є і досвідчені майстри, і спеціальне обладнання.",
            "Якість ремонту залежить значною мірою від того, з якої тканини виготовлена футболка.",
            "1. Футболки з бавовни. Бавовна має плетіння з дрібненьких ниточок, яке складно зібрати та реставрація є дуже помітною. Тому розриви на таких тканинах ми дуже охайно зашиваємо та укріплюємо, щоб більше не розривалося.",
            "2. Футболки з льону. Льон має особливу структуру, яка складається з ниток, що мають різну товщину. В місцях, де нитка тонка, такі футболки рвуться. Щоб відремонтувати розрив, потрібно зловити петлі, що розійшлися.",
            "3. Віскоза. При розривах на таких футболках ми рекомендуємо робити декор, щоб прикрити місце розриву. Будь-які шви на віскозі дуже помітні.",
            "4. Змішаний текстиль. На таких футболках деталі зроблені з різних тканин.",
            "5. Футболки з еко шкіри та з напиленням. В такому випадку ми рекомендуємо накрити місце розриву, тому що будь-які шви на такій тканині дуже помітні.",
            "Крім розривів ми ще робимо інші види ремонтів футболок:",
            "- реставрація швів, що розійшлися за допомогою спеціального обладнання;",
            "- вкорочуємо низ (повторюємо обробку, фігурний низ, з розрізами, переносимо розрізи вище);",
            "- вкорочуємо рукав (можна через верх рукава, якщо обробка низу специфічна та її потрібно зберегти);",
            "- перетягуємо, розправляємо затяжки в трикотажних футболках;",
            "- відновити шов \"оверлок\";",
            "- зняти бокову бірку або бірку на комірі (відновлюємо обробку швів);",
            "- змінюємо дизайн (якщо не сидить по фігурі можемо розібрати по швах і зібрати заново);",
            "- в майках вкорочуємо бретелі, відновлюємо обробку, вшиваємо.",
            "Важливе зауваження: футболки не фарбуємо, якщо є проблема, вирішуємо лише за допомогою голки та нитки.",
            "Відновимо вашу футболку з урахуванням наших рекомендацій та ваших побажань."
        ]
    },

    // 6
    {
        "title": "Ремонт трикотажу — наші майстри, як ювеліри, створюють диво.",
        "text": [
            "Вироби з трикотажу — одні з найулюбленіших. За такими виробами легко доглядати, в них відчуваєш себе  комфортно та вільно.",
            "Найскладніший процес ремонту трикотажу, але й найпопулярніша послуга — реставрація трикотажу  з набором петель.",
            "Немов ювеліри, майстри працюють під збільшувальним склом, з додатковим освітленням, ловлять кожну петельку та окремо її пров'язують. Ця робота коштує дорого та досить затратна по часу.",
            "Клієнти часто замовляють таку послугу, навіть в тому випадку, коли ремонт коштує дорожче ніж виріб, адже результат вартий затрат. З допомогою реставрації ми відновлюємо 90% плетіння.",
            "У випадку коли плетіння трикотажу особливе та реставрація буде помітна ми завжди попереджуємо і замовник приймає рішення чи робити реставрацію.",
            "Вартість роботи по реставрації залежить від таких факторів:",
            "1.Структура трикотажу: одношарова, двох шарова трьохшарова чи 3D (кілька рядів петель всередині матеріалу). В такому випадку робота одна, але набір петель робиться в кілька раз більше, відповідно зростає ціна.",
            "2.Розмір петель — чим менша  за розміром петля, тим більша їх кількість, складніше її зловити та відповідно тим дорожча робота.",
            "Крім реставрації ми робимо ще й інші види ремонту:",
            "- вкорочуємо низ - з пров'язуванням петель, потайним швом, з обробкою додатковим матеріалом;",
            "- вкорочуємо низ рукава з манжетом - виймаємо манжет, спускаємо петлі до тої довжини, яка потрібна і монтуємо манжет назад тими ж петлями рідною ниткою;",
            "- заміна та монтаж блискавки - ми виконуємо навіть такі особливі замовлення, коли просять розрізати светр посередині та вмонтувати блискавку;",
            "-  вкорочуємо в трикотажних штанах низ, спускаємо петлі до потрібної довжини, а потім закриваємо низ;",
            "- стягуємо розриви, перетягуємо, розправляємо затяжки та відновлюємо плетіння;",
            "- стягуємо тоненькою ниткою-резинкою край манжету чи рукава, що розтягнувся;",
            "- реставрація кетельного шва на горловині - такий ремонт проводиться в кілька етапів, спочатку збираємо петлі, що розпустилися, нарощуємо, відновлюємо плетіння та монтуємо горловину;",
            "- зняття ковтунів спеціальними інструментами;",
            "- заміна фурнітури.",
            "Результат ремонту приємно вас вразить. В \"Білошвейці\" все робиться настільки охайно, що ніхто й не помітить, що трикотажний виріб мав пошкодження."
        ]
    },

    // 7
    {
        "title": "Ремонт спортивного одягу — для ваших нових перемог та рекордів.",
        "text": [
            "Це один з найскладніших видів ремонту, але в ательє \"Білошвейка\" завжди готові до пошуку альтернативних рішень.",
            "Сучасний спортивний одяг, термоодяг — це такі матеріали та способи обробки, які доступні лише промисловому виробництву.",
            "В більшості випадків на такому одязі немає жодного шва або вони не зшиті, а склеєні спеціальними термомашинами на виробництві.",
            "Термоодяг, як правило, не зшитий, а сплетений з великої кількості структурованих ниток в суцільне полотно.",
            "Під час ремонту таких речей потрібно робити шви там, де їх ніколи не було. Ми одразу попереджуємо клієнтів, що повторити фабричну обробку на такому одязі неможливо. Спецмашини для таких обробок дуже дорогі. Але ми пропонуємо різні варіанти, щоб зробити ремонт з найменшими незручностями для клієнта.",
            "Найчастіше під низ підкладаємо матеріал, зверху формуємо шов  і виріб знову можна носити.",
            "Найпопулярніші послуги з ремонту спортивного одягу:",
            "- відновити шви, що розійшлися;",
            "- відновити плаский шов;",
            "- забрати внутрішні бирки.",
            "1. Відновити шви, що розійшлися.",
            "Ми можемо відновити як фрагмент шва так і весь шов.",
            "2. Відновити плаский шов.",
            "Такий шов складається з великої кількості ниток. Якщо пошкоджено невеликий фрагмент відновлюємо вручну та укріплюємо, щоб не було пошкоджень в майбутньому. Якщо пошкоджено великий фрагмент такого шва, ми пропонуємо інший варіант ремонту. Тому що відновлення займає багато часу та коштує дуже дорого.",
            "3.  Забрати внутрішні бирки.",
            "Не варто виривати бирки самостійно, тому що можна пошкодити як шов, так і тканину. Ми їх акуратно знімаємо та  відновлюємо шов.",
            "Дуже часто ми вшиваємо, розшиваємо, вкорочуємо футболки, легінси, топи. Легінси вкорочуємо еластичним швом. На топах можемо зробити вставку, вшити резинку, за допомогою стрічки зашити пошкодження.",
            "Особливі види ремонту:",
            "- ремонт велосипедного одягу — при пошкодженнях ремонтуємо розриви та шви, що розійшлися та укріплюємо, щоб уникнути пошкоджень в майбутньому;",
            "- ремонт спортивних купальників — вшиваємо, підшиваємо, перешиваємо;",
            "- ремонт спортивного спорядження — роботи будь-якої складності робимо швидко та відповідально;",
            "- ремонт для професійних спортсменів — ремонтуємо кімоно, одяг для верхової їзди, одяг для фехтування;",
            "- ремонт військової форми.",
            "В ательє \"Білошвейка\" ми завжди готові до будь-яких перешкод та вміємо шукати спосіб їх подолати."
        ]
    },

    // 8
    {
        "title": "Ремонт пальто — нам можна довіряти, бо маємо відповідний досвід і знання.",
        "text": [
            "В ательє Білошвейка ми знаємо про особливості роботи з усіма видами пальтових  тканин.",
            "На ремонт  часто  приносять пальто з таких тканин:",
            "- шерсть",
            "- драп",
            "- твід",
            "- букле",
            "- кашемір",
            "- бавовна.",
            "Дуже важливо розуміти, як можна обробляти тканину та чи можна її прасувати. Недосвідчений майстер може випадково праскою пошкодити пальто, змінити фактуру або розмір деталі. На жаль таку деформацію неможливо виправити до початкового вигляду.",
            "Види пальто, що ми найчастіше ремонтуємо:",
            "- класичне",
            "- оверсайз",
            "- приталене",
            "- розширене донизу.",
            "Найпопулярніші послуги з ремонту пальто:",
            "- вкоротити низ пальто або низ рукава;",
            "- перешити гудзики;",
            "- вшити пальто або рукав;",
            "- змінити дизайн;",
            "- додати декор;",
            "- відновити шви, що розійшлися;",
            "- реставрувати розриви;",
            "- замінити підкладку;",
            "- настрочити латки на лікті;",
            "- замінити або забрати наплічники;",
            "- замінити блискавку;",
            "- відремонтувати розрив пройми.",
            "Особливі види ремонту:",
            "- вкоротити низ рукава з петлями;",
            "- реставрувати шви на пальто з тканини \"дабл-фейс.\"",
            "А тепер подробиці...",
            "1. Вкоротити низ рукава з петлями.",
            "В класичних чоловічих пальтах часто на рукавах є гудзики та зроблені для них петлі. Коли потрібно вкоротити такий рукав, ці петлі є значною проблемою, яку не кожен майстер може вирішити. Співвідношення пропорцій довжини, ширини, висоти, кількості ґудзиків та петель в класичному чоловічому пальті мають дуже важливе значення.",
            "В ательє \"Білошвейка\" є досвідчені майстри, які можуть вкоротити рукав пальто підняттям за округлістю.  У таких випадках ми знімаємо рукав по проймі, вкорочуємо його зверху і потім вшиваємо назад.",
            "Вкорочення довжини рукава за округлістю — це складний процес. Необхідно повторити обробку, яка була, зберегти правильний баланс та посадку рукава. Це можна зробити тільки розуміючи особливості конструкції.",
            "Буває, домашні майстри без відповідних знань та досвіду, намагаються зробити такий ремонт. В результаті не розв'язують проблему клієнта, а створюють йому нову. Будьте уважні.",
            "2. Реставрувати шви на пальто з тканини \"дабл-фейс\".",
            "Пальто з тканини \"дабл-фейс\" використовується як з лиця, так і з вивороту. Такі пальта шиють без підкладки, вони тонкі, легкі та теплі. При пошкодженні обробка швів на таких пальтах проводиться вручну. Але ми не просто реставруємо шви, ми це робимо з додатковим укріпленням та нарощуванням фрагменту. Це все робиться для того, щоб в майбутньому розривів більше не було.",
            "Ми впевнені, що ваше улюблене пальто в руках наших досвідчених майстрів отримає друге життя та продовжить вас радувати ще не один рік."
        ]
    },

    // 9
    {
        "title": "Ремонт курток — все неможливе можливе.",
        "text": [
            "В ательє \"Білошвейка\" в 99% ми даємо рішення по ремонту виробу, в тому числі й по ремонту курток.",
            "На ремонт нам найчастіше приносять такі куртки:",
            "- вітрівка",
            "- бомбер",
            "- анорак",
            "- косуха",
            "- джинсова",
            "- пуховик",
            "- стьобана",
            "- парка",
            "- аляска",
            "Найпопулярніші види ремонту:",
            "- вкоротити низ куртки, низ рукава;",
            "- замінити на рукавах довяз;",
            "- замінити резинку, що стягує кулісу;",
            "- відновити проклеювання швів термострічкою;",
            "- замінити підкладку;",
            "- відновити розрив пройми.",
            "Але найчастіше це заміна фурнітури:",
            "- блискавок",
            "- кнопок",
            "- липучок",
            "- фіксаторів.",
            "Щоб зекономити ваш час, пошук фурнітури ми беремо на себе. Майстер, що займається закупкою має відповідний досвід, знає де знайти фурнітуру та якої якості вона має бути. Один раз в тиждень майстер відвідує десятки магазинів фурнітури в Києві, щоб підібрати конкретно під замовлення.",
            "Особливий вид ремонту - реставрація куртки після розривів. Це дуже складний процес, але це наша спеціалізація.",
            "Для такого ремонту є різні варіанти:",
            "- заклеїти термострічкою;",
            "- настрочити шеврон;",
            "- створити на місці розриву шов;",
            "- ремонт рідною тканиною.",
            "1. Заклеїти термострічкою.",
            "Основне завдання при ремонті розривів на водонепроникних куртках — зберегти функціонал, щоб не проникала вода. Саме тому голка та нитка не торкається таких розривів — лише клей. Ми зводимо краї розрізів з внутрішньої сторони та заклеюємо термострічкою.",
            "2. Настрочити шеврон. ",
            "Економ - варіант серед такого виду ремонтів. Зашиваємо місце розриву та замасковуємо шевроном.",
            "3. Створити на місці розриву шов.",
            "Зашиваємо місце розриву та робимо імітацію шва. Результат ремонту непомітний і має вигляд, що це був задум дизайнера. Такий вид ремонту підходить для прямих розривів.",
            "4. Ремонт рідною тканиною.",
            "90% проблем з куртками можна вирішити таким способом. Для проведення ремонту ми шукаємо місце всередині куртки, звідки можна взяти тканину. Далі ми цією тканиною накриваємо місце розриву.",
            "Зазвичай такий ремонт ми робимо для дорогих брендових курток, класу \"преміум\". Вартість ремонту може бути така ж як половина вартості куртки, а то й дорожче. По часу це також досить тривалий період. Але витрати цього варті. Ніхто ніколи не здогадається, що куртка була пошкоджена.",
            "Для різних клієнтів ми шукаємо різні варіанти ремонту. Хтось цінує якість, хтось дизайн, хтось кошти. Ми завжди готові розв'язати ваші проблеми з урахуванням ваших побажань, але з радістю дамо рекомендації як зробити це найкраще."
        ]
    },

    // 10
    {
        "title": "Ремонт шкіряних виробів — наша супер сила.",
        "text": [
            "Сумки, рюкзаки, куртки, спіднички, штани, дублянки, жилетки і безліч інших шкіряних речей...",
            "Ми їх ремонтуємо, ми їх фарбуємо і все на світі з ними робимо.",
            "Шкіряні вироби — одні з найулюбленіших. Вони комфортні, легкі в догляді, довго служать та зберігають шикарний вигляд.",
            "Про історії ремонту наших замовників можна писати романи. До нас частенько приїздять байкери, яким потрібно пофарбувати куртки або пришити шеврони на шкіряні жилети. Було і дівчаче замовлення по реставрації перфорованої шкіряної куртки, яку племінник розрізав манікюрними ножицями.",
            "При покупці шкіряних виробів найголовніше питання, що турбує: \"Чи натуральна шкіра?\"",
            "Продавець завжди буде переконувати, що так. Але є дуже гарний вислів: \"Довіряй та перевіряй.\"",
            "Є кілька ознак, по яких можна визначити натуральність шкіри:",
            "1. Запах нової шкіряної речі неможливо ні з чим порівняти. Штучна шкіра має дуже різкий запах синтетики, хімії та навіть клею. Але виробники штучної шкіри вже додумалися обробляти свої вироби спеціальними ароматизаторами, що нагадують запах натуральної шкіри. Тому запах це лише одна з ознак.",
            "2. Пориста поверхня. Основна перевага натуральної шкіри — тіло у таких виробах дихає. Наявність пор можна побачити навіть у пофарбованих виробах.",
            "3. Фірмова бірка. Виробник, який хоче наголосити, що він використовує саме натуральну шкіру завжди робить бірку зі шматка шкіри. Бірка робиться зазвичай у формі шкурки тварини у зменшеному вигляді, з якої зроблено вироби.",
            "4. Випробування вогнем. В магазині такий експеримент не вдасться зробити. Але вдома на бірці зі шкіри чи на припусках можна провести експеримент з запальничкою. Натуральна шкіра не горить, а тліє. Штучна шкіра спалахує дуже швидко, скручується в клубок та не дуже приємно пахне розплавленим пластиком.",
            "5. Еластичність. Натуральною шкірою можна обтягнути будь-який виріб. При цьому, навіть якщо вона відразу не буде потрібної форми, то через деякий час все лягає так як потрібно. Штучна шкіра такої властивості не має.",
            "6. Колір. Дорогі брендові шкіряні речі зазвичай мають натуральні світло-коричневі кольори. Фарба рівномірно розподіляється по поверхні. На штучній шкірі фарба залишається мазками і плямами.",
            "7. Випробування водою. Якщо є можливість капнути водою, то як правило по штучній шкірі вода стікає не затримуючись. Натуральна шкіра без додаткового покриття легко приймає вологу.",
            "8. Відчуття тепла. Від руки натуральна шкіра нагрівається та тримає тепло, штучна шкіра такої властивості не має.",
            "9. Наявність сертифікату. Якщо виробник поважає себе, своїх клієнтів та має репутацію якість продукції підтверджується відповідними документами.",
            "Які шкіряні вироби ми ремонтуємо? Все що принесете: сумки, куртки, штани, плаття, спідниці, жилетки. Перешиємо, вшиємо, замінимо фурнітуру — будь-яке ваше бажання.",
            "Найпопулярніші послуги з ремонту шкіряних виробів, що ми робимо:",
            "- ремонтуємо розриви рідкою шкірою;",
            "- фарбуємо шкіряні куртки, сумки, рюкзаки, штани і спідниці;",
            "- вкорочуємо довжину  куртки;",
            "- вкорочуємо низ рукава;",
            "- вкорочуємо низ з довязом;",
            "- замінюємо деталі в  шкіряних куртках;",
            "- замінюємо блискавку;",
            "- при ремонті швів та перешиванні виробу, зберігаємо всю обробку або повторюємо таку ж яка була;",
            "- вшиваємо рукава;",
            "- вшиваємо куртку по боках;",
            "-  замінюємо фурнітуру: блискавки, кнопки, липучки, бігунки, ґудзики;",
            "- замінюємо підкладку в куртках;",
            "- нашиваємо шеврони на байкерські шкіряні жилети.",
            "Найчастіше ремонтуємо розриви. Дуже важливо не ходити з розривом довго, тому що натуральна шкіра має властивість розтягуватись. Якщо на розрив потрапляє волога шкіра в місці розриву деформується і відреставрувати такий розрив без наслідків неможливо. Чим довше ви ходите з розривом, тим гірший буде результат ремонту та й вартість ремонту зросте в кілька раз. Якщо тільки відбувся розрив, одразу звертайтесь до спеціалістів. В такому випадку результат ремонту буде максимально непомітний та задовольнить найвибагливішого клієнта.",
            "Особливо складним є  ремонт шкіряних виробів з перфорацією. Укріплення місця розриву в таких випадках ми робимо тоненькими стрічками з клеєм, формуємо сітку і вже з допомогою сітки зводимо краї. Реставрацію потрібно робити дуже обережно, щоб рідка шкіра не потрапляла в отвори перфорації і не засихала там. Це дуже ювелірна і складна робота. Ми реставрували шкіряну куртку DSQUARED з перфорацією у вигляді дрібних сердечок, яку хлопчик порізав манікюрними ножицями. Збирали її по шматочках кілька днів, було дуже складно, вартість реставрація дуже дорога, але результат того вартий.",
            "Завжди допомагаємо та шукаємо різні варіанти як краще зробити. Все робимо для того, щоб клієнти були задоволені результатом ремонту. \"Білошвейка\" нагадує — не затягуйте з ремонтом шкіряних виробів. Якщо виникла проблема — швиденько несіть до нас. Оперативний ремонт продовжить період служби ваших шкіряних виробів."
        ]
    },

    // 11
    {
        "title": "Ремонт пуховиків — робимо багато, часто і зробимо все, щоб ваш пуховик знову був як новий.",
        "text": [
            "Пуховики надійно захищають від холоду, дощу, вітру і тому заслужено завоювали своє місце у вашому гардеробі.",
            "Щоб пуховик вас зігрівав не один рік є критерії по яких ми рекомендуємо вибирати пуховик.",
            "1. Якість наповнювача.",
            "- Суперлегкий та супертеплий — пух з гаги. Він дуже дорогий тому його використовують лише люксові бренди. Для звичайної людини догляд за такими пуховиками досить складний та його дуже легко пошкодити. Такі пуховики для догляду віддають лише в руки професіоналів.",
            "- Наступним по якості наповнювача є пух з качки. Він важчий за пух гаги,  досить щільний, зберігає тепло та заповнює пуховик всередині.",
            "- Лебединий пух є натуральний та штучний. За натуральним доглядати складно, штучний мягкий та легкий. Саме штучний лебединий пух ми найчастіше використовуємо для реставрації.",
            "Є також такі наповнювачі, як суміш пуха та пера або суміш натурального і штучного пуху.",
            "Штучний пух є таких видів:",
            "- Холлофайбер. Мягкий, легкий, не втрачає об'єм, але не супертеплий.",
            "- Ізософт. Пористий, не дуже зберігає тепло, тому краще використовувати для домашнього вжитку.",
            "- Тінсулейт. Гарно тримає тепло. Є різних видів теплопровідності — для сурових зим або демісезонний.",
            "2. Тканина з якої зроблений пуховик.",
            "3. Блискавка. Має легко закриватися та відкриватися, як по маслу.",
            "4. Шви. Потрібно уважно оглянути, щоб зі швів не виглядав пух або нитки. Згодом це призведе до того, що пуховик починає втрачати пух. І добре, якщо такі втрати будуть ззовні. Якщо ж всередині, то всі ваші кофти будуть пухнасті. Шви повинні будуть рівні, без недоліків. Тому що неякісні шви можуть  розійтися і два пух пакети змішаються в один. І тоді прийдеться відновлювати  наповнення пуху та шви.",
            "5. Об'єм. Якщо ми натискаємо та відпускаємо пуховик повинен повернутись до форми, яка була.",
            "6. Високий комір з капюшоном. Допоможе ще краще захиститися від холоду та дасть можливість ходити без шапки",
            "7. Бажано, щоб деталі пуховика відстібалися.",
            "Найпопулярніша послуга — ремонт розривів. Важливо при пошкодженні одразу заклеїти розрив малярним скотчем, щоб не втратити частину пуху та нести в ательє.",
            "Є різні способи ремонту розривів:",
            "- Накриваємо рідною тканиною. Виймаємо рідну тканину, відновлюємо пух пакет і накриваємо.",
            "- Якщо форма розриву підходить можна забрати розрив в охайний шов.",
            "- Економ-варіант - нашити шеврон або вишивку.",
            "Інші послуги по ремонту пуховиків:",
            "1. Вкорочуємо низ пуховика або рукава.",
            "2. Відновлюємо пуховик після контакту з обігрівачем. Це складно та дорого, але ми часто робимо саме такий ремонт. Заповнюємо пух пакети, відновлюємо, нарощуємо.",
            "3. Заміна підкладки або встановлення нової там де підкладки немає. Якщо всередині пуховика вилазить пух ми пришиваємо щільну підкладку і закриваємо його внутрішню сторону.",
            "4. Наповнюємо пухом фрагмент або весь виріб. Коли вдома експериментували з пранням пуховиків або в хімчистці недосушили пух збивається та відновленню не піддається. В таких випадках ми  відкриваємо пуховик, витягуємо пошкоджений пух та наповнюємо новим.",
            "5. Заміна хутра на капюшоні. Сьогодні тренд — штучне хутро, але після прання воно виглядає просто жахливо. Тому часто клієнти приходять і просять змінити на натуральний. Можемо купити самі, а може й принести  замовник. В подальшому натуральне хутро чистити можна лише в хімчистці.",
            "6. Ремонтуємо  низ куртки, що потріскався. Особливо такий дефект помітний на чорних пуховиках, коли через тріщини виглядає білий пух. Накриваємо рідною тканиною, стрічками або додатковим дов'язом.",
            "7. Проклейка порізів термострічкою. Такий ремонт робимо лише на щільних тканинах, тому що на тонких воно виглядає неохайно.",
            "8. Заміна фурнітури: бігунків, блискавок, кнопок, резинок, гудзиків та ін.",
            "Перерахувати весь спектр послуг, що ми надаємо неможливо. Завжди готові до будь-яких несподіванок. Обов'язково знайдемо рішення і ваш пуховик буде як нова копійка."
        ]
    },

    // 12
    {
        "title": "Ремонт лижного одягу — до нових звершень без перешкод.",
        "text": [
            "Вершини кличуть, адреналін зашкалює, але все може піти шкереберть — лижний одяг потребує ремонту.",
            "Ми готові до будь-яких несподіванок і готові вам допомогти.",
            "На ремонт нам приносять:",
            "- лижні куртки;",
            "- куртки для сноубордингу;",
            "- лижні комбінезони, де штани разом з курткою;",
            "- комбінезони на шлейках.",
            "- термоодяг.",
            "Найпопулярніші послуги по ремонту:",
            "1. Вкорочуємо низ куртки чи рукава. Для збереження фабричної обробки переносимо всі застібки та відновлюємо всі деталі.",
            "2. Розшиваємо штани або куртку. В основному штани розшиваємо для сноубордистів, тому що в них дуже масивне взуття. Куртки розшиваємо, зазвичай, під кінець сезону, коли важко знайти потрібний розмір.",
            "3. Вшиваємо куртку та штани з перенесенням всієї фабричної обробки.",
            "4. Заміна резинок, які з часом пошкоджуються та втрачають форму. Відновлюємо всі деталі, регулятори та фіксатори.",
            "5. Заміна блискавок, можемо поставити водонепроникну. Відновлюємо всю фабричну обробку.",
            "6. Заміна фурнітури: регуляторів, фіксаторів, бігунків, кнопок, липучок.",
            "7. Реставруємо розриви за допомогою термострічки, а також декоративних елементів та шевронів. Якщо багато дрібних порізів накриваємо новою міцною тканиною, як, наприклад ріп стоп.",
            "8. Розриви рукавів в проймі. Відреставруємо все як потрібно та обробимо термострічкою, щоб не потрапила волога.",
            "9. Заміна підкладки. Можемо замінити частково або в повному обсязі.",
            "10. Заміна довязу. Всі шви обробляємо термострічкою.",
            "11. Відновлення пошкоджених швів. Все зробимо міцно, охайно та з обробкою термострічкою.",
            "12.  Заміна термострічки. З часом термострічка пошкоджується і всередину виробу потрапляє волога.",
            "13. Заміна хутра на капюшоні. В основному це стосується заміни штучного хутра на натуральне.",
            "14. Відновлюємо шви та зашиваємо пошкодження на термоодязі. Термоодяг — це суцільне полотно з дуже дрібним плетінням. Відновити таке плетіння неможливо. Ми в таких виробах підбираємо петлі, що розійшлися та охайно зашиваємо в розтягнутому вигляді. Шви робимо такими ж еластичними як були та все працює без проблем.",
            "Ми в \"Білошвейці\" завжди готові зробити все, що від нас залежить, щоб ви у своїх зимових пригодах кайфанули на всі 200%."
        ]
    },

    // 13
    {
        "title": "Ремонт еко-шкіри - зробимо все, що в наших силах.",
        "text": [
            "Екошкіра — це штучний матеріал, верхній шар якого імітує шкіру, але нижній шар — це тканина. Проблема такого матеріалу — він дуже швидко зношується, навіть швидше ніж просто тканина.",
            "Крім того, тіло в екошкірі практично не дихає, а між тілом і матеріалом утворюється конденсат.",
            "Найшвидше зношується зовнішня сторона, яка під дією сонця, морозу, перепаду температур, прання зазнає невідворотних пошкоджень.",
            "Часто клієнти помилково вважають, що якщо ательє займається реставрацією шкіряних виробів, то вони зможуть зробити реставрацію виробів з екошкіри. Але на жаль це неможливо. Шкіра — це єдине цільне полотно, а екошкіра — тканина, покрита поліуретановою плівкою. Вироби з екошкіри спочатку мають гарний вигляд, недорого коштують, але з часом шар поліуретану тріскається та обсипається. Відновити екошкіру неможливо, єдиний вихід — замаскувати місце пошкодження. Заміна деталей виробу не завжди є варіантом розв'язання проблеми, тому що вартість ремонту може бути більша, ніж вартість виробу.",
            "Найпопулярніші види ремонту виробів з екошкіри:",
            "- вшити",
            "- вкоротити",
            "- замінити фурнітуру",
            "- замінити блискавку.",
            "Ми обов'язково докладемо максимум зусиль для ремонту вашого улюбленого одягу. Наші знання та досвід допоможуть знайти альтернативні рішення та врахувати ваші побажання."
        ]
    },

    // 14
    {
        "title": "Ремонт купальників — економія вашого часу, коштів та нервів.",
        "text": [
            "Знайти ідеальний купальник дуже важко, інколи здається, що майже нереально. Ми в \"Білошвейці\" зробимо все та навіть більше, щоб ви не розлучались зі своїм улюбленим купальником.",
            "На перший погляд, що може бути простіше ніж ремонт купальника, кілька швів і все готово. Але ремонт купальників це досить складний процес.",
            "Половина роботи з ремонту купальників — налаштування машин. При промисловому виробництві купальників одна машина робить один вид певного процесу з конкретним видом матеріалу.",
            "В ательє потрібно не просто змінити голку та нитку, а повністю обнулити налаштування машини та підібрати спосіб обробки для конкретного виду матеріалу.",
            "Сьогодні є різні матеріали з яких роблять купальники: біфлекс, лайкра, поліамід, поліестер, тактель, мікрофібра та ін. Кожний матеріал потребує особливої обробки та має властивість розтягуватись. Тому потрібно пробувати, шукати та підбирати способи обробки. Обов'язково має проводитися тестування швів та лише після перевірки, що шви будуть якісні, можна приступати до ремонту.",
            "Перешити купальник не може коштувати дешево, тому що це значний обсяг роботи та тривалий проміжок часу по налаштуванню,  адаптації обладнання та підбору матеріалів.",
            "Найчастіше ми ремонтуємо такі види купальників:",
            "- класичні",
            "- пляжні",
            "- спортивні",
            "- для художньої гімнастики",
            "- для бодибілдингу",
            "- для серфінгу.",
            "Найпопулярніші види ремонту купальників:",
            "- вшити трусики або бюстгальтер;",
            "- замінити резинку;",
            "- змінити дизайн;",
            "- відновити дефекти швів;",
            "- замінити застібку на бюстгальтері;",
            "- вкоротити шлейки;",
            "- вставити кишеньки для push up на бюстгальтері;",
            "- відновити фіксаж кісточок в бюстгальтері;",
            "- додати декор на спортивних купальниках;",
            "- змінити форму чашки в бюстгальтері;",
            "- переробити купальник з суцільного на роздільний;",
            "- замінити регулятор в шлейках.",
            "Наші майстри ремонтують купальники дуже часто. Спеціалізація таких майстрів — лише купальники та спідня білизна.  Вони шиють купальники їх на замовлення, тому розуміють всі тонкощі такого ремонту. Під час ремонту завжди порадять, підкажуть як краще і ваш купальник буде ще кращий ніж до ремонту."
        ]
    },

    // 15
    {
        "title": "Ремонт шуб та дублянок — нам довіряють найдорожче.",
        "text": [
            "Пошкодження улюбленої  шуби чи дублянки — це просто катастрофа. В ательє \"Білошвейка\" ми повернемо вашій шубі ідеальний вигляд.",
            "Для ремонту шуб та дублянок з натурального хутра потрібні спеціальні знання технології пошиття таких виробів. Це дуже складний процес, але наші майстри мають і спеціальні знання, і багаторічний досвід.",
            "Ми ремонтуємо шуби та дублянки як з еко хутра, так і з натурального хутра.",
            "Еко хутро — це текстильний матеріал, схожий на товсту пальтову тканину. Він не потребує спеціальної обробки, знань та обладнання. Вироби з еко хутра ми ремонтуємо швидко та легко.",
            "Ми також надаємо консультації для клієнтів по перевірці хутра на натуральність. Часто під виглядом натурального хутра продають вироби зі штучного хутра і, на перший погляд,  відрізнити їх важко. Але ми це вміємо і проконсультуємо без проблем.",
            "Дуже важлива рекомендація - ніколи не ремонтуйте шуби та дублянки вдома за рекомендацією з інтернету. Часто нам приносять на ремонт норкові шуби склеєні суперклеєм. Шматочки хутра від такого ремонту твердіють, тріскаються та обсипаються. І вартість ремонту після такого склеювання зростає у 2-4 рази, а відновлення до початкового вигляду неможливе.",
            "На вартість ремонту шуби з натурального хутра впливає багато різних факторів, основними з яких є:",
            "- з яких шматочків хутра пошиття;",
            "- який стан вичинки, вона м'яка, зношена чи затверділа;",
            "- який стан внутрішніх швів;",
            "- яка довжина ворсу хутра (на короткому ворсі робота має бути по особливому делікатна, щоб шви не були помітні);",
            "- яка модель шуби (якщо потрібно змінювати дизайн від цього залежить обсяг роботи та можливість перешити таку модель в іншу).",
            "Ми працюємо з різними видами хутра: норка, лисиця, песець, єнот, видра, тюлень, нутрія, ондатра, бобер, шиншила, кролик, каракуль, соболь.",
            "Шуби ми зшиваємо кушнірським швом або вручну з використанням спеціального обладнання та інструментів.",
            "Види ремонту:",
            "- реставрація розривів та потертостей (при потребі та за бажанням робимо реставрацію з додатковим укріпленням та з нарощуванням рідного хутра);",
            "- зміна дизайну;",
            "- вкорочення довжини шуби або рукавів;",
            "- ремонт після саморобного проклеювання;",
            "- вшиваємо, розшиваємо шуби та рукава;",
            "- додаємо, змінюємо капюшони та манжети;",
            "- заміна, укріплення гачків та петель;",
            "- заміна підкладки;",
            "- пришиваємо декоративні гудзики.",
            "Після ремонту та з урахуванням рекомендацій наших  майстрів ваша шуба або дублянка буде радувати та зігрівати ще не один рік."
        ]
    },

    // 16
    {
        "title": "Ремонт спідньої білизни — дуже ніжно та обережно відновимо до ідеального стану.",
        "text": [
            "Білизна, яку не відчуваєш на тілі та яка лягає немов друга шкіра - мрія кожної жінки. І коли знаходиш саме її, радості немає меж. Тому пошкодження такої білизни це справжня катастрофа.",
            "Адже спідня білизна, крім бавовняної, потребує дуже делікатного догляду. Її не можна прасувати, прати при високих температурах та на швидких обертах.",
            "Найчастіше нам приносять білизну на ремонт в таких випадках:",
            "- механічні пошкодження (наприклад домогосподарка спалила праскою сітку на трусиках La Perla);",
            "- пошкодження після тривалого періоду використання (білизна складається з кількох видів матеріалів, які мають різну зносостійкість та різне навантаження);",
            "- після придбання білизни, яка не підійшла по розміру.",
            "Види спідньої білизни та найпопулярніші послуги по її ремонту:",
            "1. Трусики:",
            "- вшиваємо по боковому шву та між ногами;",
            "- розшиваємо з додаванням окремих деталей, стрічки;",
            "- заміна резинки;",
            "- заміна фрагментів мережива.",
            "2. Бюстгальтери:",
            "- вшиваємо в об'ємі (виймаємо застібку, зменшуємо об'єм, монтуємо застібку, відновлюємо обробку);",
            "- заміна резинок, регуляторів на шлейках;",
            "- ремонт пошкоджень від кісточок (реставруємо місце пошкодження та кісточки, накриваємо додатковим матеріалом для укріплення, щоб попередити розриви в майбутньому);",
            "- відновлюємо сітку після розривів по швах (шукаємо ідентичну, вставляємо в пошкоджені фрагменти та відновлюємо всю відстрочку);",
            "- вшиваємо чашку бюстгальтера на пів розміру, а той на розмір (дуже складно все розібрати, тому що дуже міцна фабрична обробка, але у нас є майстер, що вшиває та відновлює обробку);",
            "- змінюємо лінію чашки бюстгальтера;",
            "- переставляємо, вкорочуємо, реставруємо шлейки;",
            "- відновлюємо мереживо (для цього підбираємо спеціальні ниточки, схожі по текстурі та по кольору, відтворюємо фрагмент мережива з ідентичним плетінням та малюнком).",
            "3. Корсети:",
            "- вшиваємо по застібці;",
            "- розшиваємо по застібці за допомогою додаткових елементів;",
            "- вшити по кісточках (знімаємо декілька деталей, змінюємо форму, монтуємо назад, відновлюємо обробку);",
            "- зміна форми корсета знизу чи зверху (обробляємо стрічкою форми вирізу, вкорочуємо, якщо не влаштовує довжина);",
            "4. Боді:",
            "- реставруємо застібку, яка розтягнулась (знімаємо застібку, вкорочуємо пошкоджений фрагмент, монтуємо назад);",
            "- зміна незручної застібки (знімаємо та ставимо нову, яка не буде заважати).",
            "5. Нічні сорочки, комбінації з мереживом:",
            "- реставруємо мереживо, що розпустилося (не просто зшиваємо, тому що мереживо стягнеться і буде спотворений малюнок, а нарощуємо та проплітаємо пошкоджений фрагмент, відтворюємо ідентичний малюнок.",
            "Результат ремонту спідньої білизни в \"Білошвейці\" завжди проводимо на такому рівні, що клієнти завжди задоволені та вдячні. Адже  після ремонту отримують виріб, на якому немає жодних ознак, що він був пошкоджений."
        ]
    },

    // 17
    {
        "title": "Фарбування шкіряних виробів —  нам під силу розв'язання будь-якої вашої проблеми: від простого ременя до брендової шкіряної куртки з перфорацією.",
        "text": [
            "Ваша улюблена шкіряна куртка має втомлений та затертий вигляд. В Білошвейці ми зробимо все можливе, щоб відновити її та повернути вам такою, як ви побачили її в перші хвилини після покупки.",
            "Найважливіше — для фарбування підходить лише натуральна шкіра.",
            "Фарбуємо будь-які шкіряні вироби: куртки, пуховики, сумки, рюкзаки, жилетки, ремені, рукавиці, шапки.",
            "Кожний виріб та вид шкіри має свої особливості фарбування, тому запорука гарного результату  в \"Білошвейці\" — майстри, що мають досвід та знання. Різні види шкіри мають різну пористість та різні види покриття. Куртку з замші та куртку з лакової шкіри фарбують різними методами.",
            "Незнання всіх тонкощів призводить до непередбачуваних та неприємних наслідків.",
            "Перший етап фарбування — це підготовка. Нереально просто взяти куртку, повісити на дерево та обробити її з пульверизатора. Щоб фарба гарно лягала ми робимо додаткове ґрунтування. Після цього фарбуємо, а на завершення для закріплення проводимо фінішування.",
            "Якісно провести фарбування або ремонт шкіряних виробів в домашніх умовах неможливо, щоб вам там не розказували порадники з інтернету. Відсутність необхідних знань та спеціальних складників для фарб призведе до того, що ваш виріб буде ще в гіршому стані ніж до ваших маніпуляцій.",
            "Для фарбування ми використовуємо колорування. Майстер бере кілька кольорів фарби, перемішує їх, потім наносить на фрагмент виробу та дивиться чи підходить колір. Фарбування проводиться лише після того, як буде знайдено ідентичний відтінок кольору.",
            "Неможливо просто взяти наколотити, перемішати та щоб все було гарно. Колір фарби в банці може бути схожий на той, який потрібний. Але при нанесенні фарби на виріб та після висихання фарба змінює відтінок. Тому потрібно ще й мати знання як фарби можуть змінювати колір на різних видах шкіри.",
            "Найскладніше фарбувати перфоровані куртки зі шкіри. Така шкіра складається з дрібних отворів, в які потрапляє фарба. Чим дрібніші отвори, тим складніше фарбування. Щоб отримати гарний результат роботи ми покриваємо такий виріб кількома тонкими шарами фарби і кожен цей шар просушуємо.",
            "Виріб ми можемо зафарбувати як повністю, так і частково. При фарбуванні обов'язково накриваємо фурнітуру, щоб на неї не потрапила фарба. Деякі сумки фарбуємо вручну пензликом або щіточкою, немов художники реставратори, щоб не пропустити жодну щілину. В окремих випадках фурнітуру знімаємо, а після фарбування монтуємо на місце.",
            "Часто фарбуємо потертості, щоб оновити виріб. Після фінішної обробки з'являється фабричний легкий глянець та приємний аромат нової шкіри.",
            "Якщо є бажання замовника можемо кардинально змінити колір. З білого в синій чи червоний, зі світлого в темніший — все на що готова ваша фантазія.",
            "Після фарбування отримаєте виріб, немов тільки з магазину. Вам буде не лише приємно дивитись та тримати його в руках, а одразу виникне бажання одягнути на себе тут і зараз."
        ]
    },

    // 18
    {
        "title": "Ремонт піджаків — ми знаємо як відновити ваш піджак з дотриманням стандартів, пропорцій та балансу.",
        "text": [
            "Чоловічі піджаки дорогих люксових брендів — це результат кропіткої роботи, адже покупець повинен мати в ньому ідеальний вигляд. Майстри при пошитті таких піджаків в буквальному сенсі слова вилизують кожну деталь.",
            "Щоб проводити ремонт таких виробів потрібно, як мінімум, розуміти технологію виробництва, як максимум, шити його самостійно.",
            "Майстер обов'язково повинен спеціалізуватися саме на чоловічих піджаках, адже внутрішня обробка швів у таких виробах не зустрічається більше ніде.",
            "Це потрібно чітко знати та розуміти, що можна робити з піджаком, а що ні. Наприклад, піджаки ні в якому разі не можна прасувати, тому що в них деформуються деталі і потім взагалі нічого не виправити.",
            "Найпопулярніші послуги по ремонту піджаків:",
            "1. Вкоротити низ піджака з відновленням фабричної обробки та петель.",
            "2. Звузити піджак або рукав по рельєфу.",
            "3. Частково перекроїти піджак.",
            "4. Замінити підкладку в піджаку чи в кишені піджака.",
            "5. Перешити ґудзики.",
            "6. Зашити або розшити кишені. Є чоловіки, які зашивають кишені, щоб не розтягувати краї входу. Якщо виникає бажання їх використовувати, охайно та обережно розшиваємо.",
            "7. Реставрувати розриви. Для такого виду ремонту ми пропонуємо  три різні способи:",
            "- зробити симетрично два шви;",
            "- ручна штопка, якщо тканина рельєфна;",
            "- нарощування рідної тканини.",
            "Найскладніший є ремонт по вкороченню низу рукава. Якщо петлі на рукавах не прорізні все простіше. Вкорочуємо довжину рукава, переносимо петлі трохи вище, щоб дотримуватись пропорцій, що є дуже важливим пунктом при ремонті чоловічих піджаків.",
            "Якщо петлі на рукаві прорізні, все набагато складніше. Спава в тому, що при значному вкороченні довжини рукава, пропорції порушуються, петля потрапляє на згин низу рукава. Це виглядає просто жахливо, тому для таких піджаків ми пропонуємо вкорочення рукавів підняттям за округлістю. Ми зверху знімаємо всю обробку, вкорочуємо, монтуємо назад та відновлюємо обробку. Такий процес  - велика кількість ручної роботи, яка займає багато часу, відповідно вартість такого ремонту висока. Але чоловіки, які звикли до високих стандартів у всьому, розуміють для чого це потрібно, чому важливо і замовляють таку послугу в нашому ательє.",
            "Дуже складно знайти майстра, який правильно посадить рукав, щоб не з'явились додаткові складки, щоб був правильний баланс рукава. Був випадок, коли клієнт приніс піджак після ремонту непрофільним майстром. Рукав був вшитий з порушенням центру балансу аж на 2 см, посадку рукава було порушено і все це мало жахливий вигляд з величезною кількістю складок, немов волани на жіночій сукні. Якщо проводити ремонт без розуміння тонкощів роботи з чоловічими піджаками, без відповідної освіти, методом втика, результат буде саме таким.",
            "В Білошвейці є два майстри, їх спеціалізація — ремонт чоловічих піджаків. Це майстри, які мають знання та досвід, що з цими піджаками робити. Вони розуміють як чоловічий піджак влаштований, як він має сидіти, яку обробку він має проходити.",
            "Сміливо можете нам довіряти. Гарантуємо, що результат ремонту вас приємно здивує."
        ]
    },

    // 19
    {
        "title": "Ремонт текстилю — від реставрації розривів на тюлі, коли на ній покатався ваш котик до роботи над замовленням для клієнта, що перешиває м'які меблі.",
        "text": [
            "Ваш дім — це комфорт та затишок, де кожна деталь продумана до дрібниць. Якщо з улюбленими домашніми речами трапляються негаразди це добряче може вивести з рівноваги. В ательє \"Білошвейка\" завжди готові допомогти повернути гармонію у ваш дім.",
            "Найчастіше нам приносять на ремонт штори та тюлі. Що нас просять зробити:",
            "- вкоротити;",
            "- змінити розмір;",
            "- реставрувати розриви;",
            "- поставити люверси;",
            "- пришити шторну стрічку;",
            "- зробити петлі на липучках та петлі захвату.",
            "Часто також приносять постільну білизну. Що нас просять зробити:",
            "- змінити розмір;",
            "- поставити блискавку;",
            "- проштопати розриви;",
            "- зробити простинь на резинці.",
            "Крім того, ми надаємо такі послуги:",
            "- реставруємо поверхню тканини на ковдрах та подушках (найчастіше після розваг улюблених котів);",
            "- відновлюємо або замінюємо резинку на наматрасниках;",
            "- вшиваємо, вкорочуємо, ремонтуємо халати;",
            "- вкорочуємо та обробляємо краї скатертини;",
            "- робимо реставрацію плетених доріжок (шукаємо схожу нитку та вручну нарощуємо місце розриву);",
            "- шиємо на замовлення фартухи з текстилю та зі шкіри (приймаємо як індивідуальне так і групове замовлення);",
            "- можемо зробити петельки на рушниках, щоб зручно було вішати;",
            "- пошив декоративних подушок.",
            "Ми завжди готові до особливих замовлень, коли потрібно врахувати побажання клієнта та запропонувати цікаве рішення.",
            "З останніх таких замовлень:",
            "- є замовник, що перешиває м'які меблі, приносить нам викрійки потрібних деталей, ми шиємо, а він далі використовує їх у своїй роботі;",
            "- є замовник, якому робили оббивку в прихожу з прямокутних подушок на липучках, він обрав тканину, ми зробили одну таку подушку на тумбочку, іншу таку ж для кріплення на стіну.",
            "Ремонт домашнього текстилю в ательє \"Білошвейка\" додасть вашому дому гарного настрою та продовжить термін служби улюблених домашніх речей."
        ]
    },

    // 20
    {
        "title": "Ремонт сумок — від простої заміни застібки до складної реставрації старовинних сумок.",
        "text": [
            "Улюблена сумка завжди з вами, ви знаєте все про неї, а вона про вас. Будь-яку річ в такій сумці ви можете знайти з закритими очима. І коли з нею трапляються негаразди, рука не підніметься її викинути.",
            "Ми відремонтуємо будь-яку сумку:",
            "- з еко шкіри;",
            "- з текстилю;",
            "- декоративну з хутра, з вишивкою, зі стразами;",
            "- з натуральної шкіри;",
            "- рюкзаки туристичні;",
            "- рюкзаки шкільні;",
            "- фоторюкзаки;",
            "- чохли для музичних інструментів;",
            "- чохли для спортивного спорядження.",
            "Також зробимо реставрацію старовинних сумок, підберемо схожі матеріали та вручну відновимо до первинного вигляду.",
            "Найчастіше в сумках ми змінюємо фурнітуру. Шукаємо схожу деталь або ідентичну, робимо демонтаж старої та встановлюємо нову.",
            "Не завжди заміна фурнітури це швидко й легко. Досить складно замінити блискавку в фоторюкзаку. Ми це робимо на спеціальному обладнанні, що використовується для роботи з товстими тканинами.",
            "Найкраще піддаються ремонту сумки з натуральної шкіри. Для роботи зі шкірою маємо спеціальне обладнання та майстрів, що мають відповідні знання та досвід.",
            "Завдяки тому, що шкіра легко піддається реставрації, ми робимо просто колосальні перевтілення. Якщо ви бажаєте, після ремонту отримаєте кардинальне оновлення вашої сумки.",
            "Найпопулярніші послуги з ремонту шкіряних сумок:",
            "- заміна ручок (металеві ручки змінюємо на будь-які інші, якщо шкіряні пошкоджені, замінюємо на нові зі схожої шкіри, короткі ручки переробляємо на довгі);",
            "- ремонт вріза на ручках (це оздоблювальний елемент, який швидко зношується, ми відновлюємо та фарбуємо спеціальною фарбою);",
            "- фарбування сумки (перефарбовуємо всю сумку або частково, оновлюємо колір, зафарбовуємо потерті куточки та шви біля блискавки);",
            "- відновлення швів, потертостей та розривів;",
            "- заміна підкладки в сумці.",
            "В ательє \"Білошвейка\" ваша улюблена сумка отримає друге дихання та прослужить після ремонту ще не один рік.",
        ]
    },

    // 21
    {
        "title": "Ремонт аксесуарів - улюблені речі повернуться до вас оновлені та вдосконалені.",
        "text": [
            "За роки роботи в ательє \"Білошвейка\" приносили для ремонту просто неймовірні речі. З останнього: ремонтували ковбойські капелюхи, обробляли краї шаликів з зображенням картин відомого художника, відновлювали бахрому у вигляді макраме на старовинній хустині.",
            "Зупинимося на тих аксесуарах, з якими звертаються найчастіше та що ми з ними робимо.",
            "1. Шапки — зменшуємо об'єм, вшиваємо фліс, пришиваємо резинку, набираємо петлі, реставруємо розриви.",
            "2. Капелюхи — зменшуємо об'єм, вшиваємо зав'язки, додаємо та відновлюємо декор.",
            "3. Шарфи, шалики, хустки, парео — оброблюємо та укріплюємо краї,  зменшуємо довжину та ширину, відновлюємо бахрому.",
            "4. Рукавиці — ремонтуємо рідкою шкірою, набираємо петлі, пришиваємо відірвані деталі, реставруємо потертості.",
            "5. Ремені — змінюємо довжину, пробиваємо додаткові отвори.",
            "Нам приносять на ремонт дуже різноманітні речі. Ми готові до будь-яких несподіванок та завжди пропонуємо кілька варіантів розв'язання вашої проблеми."
        ]
    },

    // 22
    {
        "title": "Ремонт мото-одягу — вміємо, знаємо, практикуємо.",
        "text": [
            "Мото-одяг має свою специфіку пошиття та ремонту. Потрібно мати обладнання та матеріали для роботи з товстими тканинами. Важливо також, щоб були міцні нитки та розуміння, як це ремонтувати. Навантаження на нитки та матеріал дуже велике, відповідальність за правильний ремонт також, у зв'язку зі специфікою використання.",
            "Зазвичай мото-одяг шиють з натуральної шкіри, але є  полегшені види одягу з тканини або змішані: частина зі шкіри, частина з тканини.",
            "Найпопулярніші послуги по ремонту мото-одягу:",
            "1. Фарбування мото-одягу. Можемо пофарбувати частково або повністю весь виріб.",
            "2. Відновлення мото-одягу після ДТП або після падінь з мотоцикла. Реставруємо місце пошкодження рідкою шкірою та оновлюємо основну частину. Якщо виріб сильно пошкоджений, виймаємо фрагмент деталі та замінюємо його на інший.",
            "3. Вшити куртку: розбираємо, вшиваємо, відновлюємо обробку.",
            "4. Заміна фурнітури: блискавки, бігунків, кнопок.",
            "5. Закріплення пластикового захисту. Якщо заважає захист, що знаходиться всередині куртки чи штанів, знаходимо рішення та закріплюємо так, щоб було комфортно.",
            "6. Відновлення швів, що розійшлися. Обов'язково з додатковим укріпленням, щоб вберегти від розривів в майбутньому.",
            "7. Настрочити латки на лікті та коліна. Обов'язково відновлюємо обробку та  оновлюємо основну частину.",
            "8. Реставрація моторукавиць. Оновлюємо колір, відновлюємо поверхню. У випадку значних пошкоджень можемо зробити латки, але ми такий ремонт не рекомендуємо робити. Якщо рукавиці сильно пошкоджені варто придбати нові.",
            "Ми також ремонтуємо:",
            "- спеціальні гоночні костюми;",
            "- костюми для фехтування;",
            "- костюми для екстремальних видів спорту.",
            "Одним з найскладніших випадків ремонту було замовлення із мото-штанів та куртки зробити комбінезон.",
            "Ми вмонтували в штани одну частину блискавки, в куртку другу частину. В результаті отримали куртку та штани, які, якщо є бажання, можна перетворити на комбінезон. Це було складно та дорого, але клієнт був задоволений результатом.",
            "Виконаємо будь-які ваші забаганки в ремонті та запропонуємо різні варіанти, розв'язання проблеми.",
            "Виконаємо ремонт так, щоб носилося довго, трималося міцно, сиділо комфортно і ви отримували задоволення від подорожей та швидкості."
        ]
    },

    // 23
    {
        "title": "Ремонт незвичайних речей.",
        "text": [
            "Ми в \"Білошвейці\" обожнюємо ремонтувати одяг та бачити радість клієнта від зустрічі з улюбленою річчю після оновлення. На ремонті одягу ми, як кажуть: \"Не один пуд солі з'їли\" і знаємо про нього все і навіть більше. Робимо ремонт одягу швидко та  якісно.",
            "Та отримуємо ще більше задоволення від розгадування ребусів по ремонту незвичайних речей, які ми бачимо вперше в житті. Особливо, коли не знаємо з якої сторони підійти до розв'язання проблеми та що з нею робити.",
            "Прайсу на ремонт таких речей немає, тому оцінюємо індивідуально кожне замовлення прогнозуючи витрати часу і намагаємось це зробити до початку робіт. В окремих випадках затверджуємо ціну в процесі роботи, тому що виріб потрібно відкрити та розібрати. Лише після цього можна зрозуміти обсяги роботи, витрати по часу та по матеріалах.",
            "Послуги по ремонту незвичайних речей, які ми вже робили:",
            "1. Ремонт батута.",
            "На батуті були розриви на сітці та на основній тканині. На основній тканині ми зробили міцні великі латки. Сітку затягнули додатковими нитками та відновили фрагменти плетіння.",
            "2. Ремонт кінської збруї.",
            "Нам приносили набір шкіряних ременів для упряжі поні, які розтягнулися. Ми їх вкорочували та підганяли під той розмір, який був потрібний.",
            "3. Ремонт кухонної доріжки із лляних канатиків.",
            "Доріжка складалася з різнокольорових льняних канатиків. Пошкоджений фрагмент був натурального світло-коричневого кольору. Ми шукали схожий канатик, відновлювали плетіння, повторюючи малюнок.",
            "4. Ремонт одягу для собак.",
            "Ремонтували комбінезони, вшивали сорочки, кофточки, замінювали кнопки на курточці.",
            "5. Пошив шкіряних аксесуарів для вечірки вікінгів.",
            "Замовник приніс лист шкіри, намалював ескізи шкіряних браслетів та ременів. Ми викроїли та зібрали потрібні аксесуари з металевою фурнітурою.",
            "6. Ремонт сучасної військової форми.",
            "Підганяли форму перевстановлювали деталі, щоб було зручно. Наприклад, на кашкеті була незручна кокарда. Ми демонтували її, зробили всередині спеціальну прокладку і назад вмонтували кокарду. Також вшивали піджаки та вкорочували їх довжину.",
            "7. Реставрація старовинної військової форми.",
            "Замовник приносив форму прадідуся, яка перейшла в спадок. Від часу нитки та шви розійшлися, потрібно було їх відновити, перешити, укріпити та довести до ладу.",
            "8. Підгонка кобури.",
            "Замінювали пошкоджені резинки, вкорочували довжину.",
            "9. Реставрація жіночої сумочки XVIII ст.",
            "Вона була оздоблена старовинним бісером, потрібно було відновити пошкоджений малюнок. Дуже довго шукали бісер, щоб був максимально схожий. Частково покривали деякі фрагменти бісеру лаком, просушували та потім монтували на сумку. Відновлювали оздоблення ручними стібками.",
            "10. Ремонт старовинної жіночої сумочки з металевим декором.",
            "Основні деталі сумки були з тканини, а декор складався з багатьох ланцюжків, які були пошкоджені. Ми з'єднували ланцюжки та пришивали їх до основних деталей.",
            "11. Реставрація старовинної хустини, якій було близько 300 років.",
            "Відновлювали на краях  плетіння шовкової чорної бахроми. Шукали шовкові нитки схожого кольору та нарощували пошкоджені фрагменти. Також частково реставрували вручну поверхню хустини. Реставрація була зроблена охайно, але помітною. Замовниця була задоволена реставрацією. Вона дуже хотіла використовувати хустину на святкових заходах та щоб видно було, що вона старовинна.",
            "12. Реставрація старовинної весільної вишиванки 1900 р.",
            "Було пошкоджено фрагмент льону. Шукали схожу за кольором льняну тканину, виймали нитки, вручну робили штопку та відновлювали плетіння.",
            "13. Ремонт ортопедичних поясів - бандажів.",
            "Вшивали до потрібного розміру, робили заміну липучок, підгонку резинок.",
            "14. Пошив спортивних ременів для підтримки штанги.",
            "Такі аксесуари є в продажу, але часто тренерів не влаштовують розміри. Нам приносять спеціальну дуже міцну стрічку, дають розмір і ми шиємо такі аксесуари. Робота проводиться на спеціальному обладнанні, що робить супер міцні шви.",
            "15. Ремонт чохлів для дитячих візків:",
            "- заміна кнопок;",
            "- заміна блискавок;",
            "- встановлення додаткових накладок на візок та на ручку;",
            "- пошив та заміна деталей (наприклад, якщо не подобається колір або є бажання зробити індивідуальний дизайн).",
            "16. Ремонт чохлів для меблів.",
            "- заміна блискавок;",
            "- заміна бігунків;",
            "- заміна пошкоджених фрагментів.",
            "17. Пошив шкіряного чохла для гриля.",
            "Індивідуальне замовлення з нуля за мірками замовника. Такий чохол можна також зшити з тканини.",
            "18. Ремонт взуття з тканини.",
            "Найчастіше — це кросівки з трикотажу. Відновлюємо пошкоджений фрагмент, робимо штопку вручну, обов'язково з додатковим укріпленням. Відновлюємо рельєф покриття максимально схожими нитками.",
            "19. Ремонт уніформи.",
            "Часто вшиваємо кітелі для шеф-кухарів, форму для співробітників ресторанів, кав'ярень. Як правило, уніформа стандартного розміру та не завжди відповідає фігурі. Підганяємо одяг, робимо ремонт, реставрацію та заміну деталей. Робимо підгонку уніформи для співробітників МакДональдс.",
            "Ми завжди готові до таких головоломок та намагаємося виконувати будь-яке замовлення, що пов'язане з ремонтом одягу та текстилю. Наш досвід у швейній справі та розуміння всіх тонкощів в роботі допомагає в цьому. Але навіть коли розв'язання проблеми не в сфері швейної майстерності завжди в пошуку альтернативного рішення."
        ]
    }
]

$('#exampleModal').on('show.bs.modal', function (event) {
    var button = $(event.relatedTarget)
    var id = button.data('id') 
    var modal = $(this).get(0)

    modal.querySelector('.modal-title').innerHTML = popups[id].title

    var modalText = modal.querySelector('.modal-text')
    var slidesNum = button.data('slides')
    var service = button.data('service')

    console.log()
    
    //Insert slides in carousel
    for (let i = 1, s = 1; i <= slidesNum; i++, s+=2) {
        $('.owl-carousel')
        .trigger('add.owl.carousel', 
            [`<div class="slide">
                <div class="slide-top">
                    <div class="before-after-slide-wrap">
                        <div class="img after-img" style="background-image: url(img/services/${service}/${service}-${s + 1}.jpg)"></div>
                        <div class="img before-img" style="background-image: url(img/services/${service}/${service}-${s}.jpg)"></div>
                        <input type="range" min="0" max="100" value="50" class="before-after-slider" name='slider'>
                        <div class="drag-line"></div>
                        <div class='slider-button'></div>
                    </div>
                </div>
                <div class="mt-3 mb-2 mt-sm-5 mb-sm-3 d-flex justify-content-center before-after-title">
                    <div class="title">До</div>
                    <div class="title">Після</div>
                </div>
            </div>`])
    }

    $(".before-after-slider").on("input change", (e) => {
        const sliderPos = e.target.value;
        $('.before-img').css('width', `${sliderPos}%`)
        $('.slider-button, .drag-line').css('left', `${sliderPos}%`)
    });


    // Insert p elements in div with class "modal-text"
    popups[id].text.forEach(str => {
        var p = document.createElement('p');
        p.innerHTML = `${str}<br><br>`;
        modalText.append(p);
    })
})


//Remove all p in div with class "modal-text" and slides before modal window closing
$('#exampleModal').on('hide.bs.modal', function () {
    var modal = $(this).get(0)
    while(modal.querySelector('.modal-text p')){
        modal.querySelector('.modal-text p').remove()
    }

    var slides = modal.querySelectorAll('.owl-carousel .slide')

    for(let i = 0; i < slides.length; i++) {
        $('.owl-carousel').trigger('remove.owl.carousel', [0])
    }
})


$('#exampleModal').swipe({
    swipe:function(event, direction, distance, duration, fingerCount, fingerData) {
    
        if(direction == "down" && $(this).scrollTop() <= 0){
            $(this).modal('hide');
        }  
        else{
            console.log($(this).scrollTop())
        }
    },
    preventDefaultEvents: false
})

